In [4]:
import re

In [2]:
# download contents of a web page
import requests
html = requests.get('https://www.ssa.gov/oact/babynames/decades/century.html').text

#html[:1000]
#prints first 1000 characters of HTML request

In [20]:
names = re.findall(r'<td >(.+?)</td> <td>(.+?)</td>', html)
#finds all names and total babies with name in html request, non greedy request
#names

In [21]:
def make_int(x):
    name, count = x
    return (name, int(count.replace(',','')))           

names = list(map(make_int, names))
#converts string value of name count into int by taking out commas
#names

In [30]:
# Sort list of names alphabetically by name
names.sort()
#print('Sorted alphabetically: ')
#names

In [39]:
# Sort list according to frequency high -> low
names.sort(key=lambda x: x[1], reverse=True)
print('Top 10 names by frequency: ')
names[:9]

Top 10 names by frequency:

[('James', 4700229),
 ('Robert', 4455696),
 ('John', 4453807),
 ('Michael', 4335919),
 ('William', 3564276),
 ('David', 3564053),
 ('Mary', 3196385),
 ('Richard', 2454407),
 ('Joseph', 2335792)]

In [41]:
#Convert list to pandas dataframe:
import pandas 
df_names = pandas.DataFrame(names, columns=['Name','Frequency'])  
print('Top 10 names by frequency: ')
df_names.sort_values(by=['Frequency'],ascending=False).head(10)

Top 10 names by frequency:

      Name  Frequency
0    James    4700229
1   Robert    4455696
2     John    4453807
3  Michael    4335919
4  William    3564276
5    David    3564053
6     Mary    3196385
7  Richard    2454407
8   Joseph    2335792
9   Thomas    2151864